src/app/Http/Middleware/HandleSlugRedirects.php

    public function handle(Request $request, Closure $next): Response
    {
        if ($request->isMethod('GET')) {
            $path = '/'.ltrim($request->path(), '/');
            $normalizedPath = $path === '//' ? '/' : $path;

            $redirect = Redirect::query()
                ->where('is_active', true)
                ->where('from_path', $normalizedPath)
                ->first();
---
select * from "redirects" where "is_active" = 1 and "from_path" = '/portfolio/necessitatibus-ut-necessitatibus-9658' limit 1