src/app/Http/Controllers/PublicController.php

    public function service(string $serviceSlug): View
    {
        $service = Service::query()
            ->with('portfolioCases')
            ->published()
            ->where('slug', $serviceSlug)
            ->firstOrFail();

        $relatedServices = Service::query()
            ->published()
            ->where('id', '!=', $service->id)
            ->orderBy('title')
            ->limit(4)
            ->get();
---
select "portfolio_cases".*, "portfolio_case_service"."service_id" as "pivot_service_id", "portfolio_case_service"."case_id" as "pivot_case_id" from "portfolio_cases" inner join "portfolio_case_service" on "portfolio_cases"."id" = "portfolio_case_service"."case_id" where "portfolio_case_service"."service_id" in (2)