src/app/Services/FormPlacementService.php

    public function forEntity(Model|string $entity, ?int $entityId = null): Collection
    {
        $type = is_string($entity) ? $entity : class_basename($entity);
        $id = $entityId ?? ($entity instanceof Model ? $entity->getKey() : null);

        if ($id === null) {
            return collect();
        }

        return FormPlacement::query()
            ->with('form')
            ->where('entity_type', $type)
            ->where('entity_id', $id)
            ->where('is_enabled', true)
            ->whereHas('form', fn ($query) => $query->where('is_active', true))
            ->orderBy('id')
            ->get();
---
select * from "form_placements" where "entity_type" = 'PortfolioCase' and "entity_id" = 1 and "is_enabled" = 1 and exists (select * from "forms" where "form_placements"."form_id" = "forms"."id" and "is_active" = 1) order by "id" asc